zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_dev_config.c
/**
  ******************************************************************************
  * @file    stm32wb07_06_dev_config.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Source file for external uC - stm32wb07_06 in network coprocessor
  *          mode (Event callbacks). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "stm32wb07_06_utils.h"

/************** Do not change this define section ************/

#define CONFIG_HW_LS_RO           0xFF
#define CONFIG_HW_LS_XTAL         0x00

#define CONFIG_HW_SMPS_10_UH              0xFF
#define CONFIG_HW_SMPS_2_2_UH             0x00
#define CONFIG_HW_SMPS_NONE               0x01
#define CONFIG_HW_SMPS_1_5_UH             0x02

#define USER_MODE               0xFF
#define LS_CRYSTAL_MEASURE      0x01
#define HS_STARTUP_TIME_MEASURE 0x02
#define TX_RX_MODE              0x03

#define MASTER_SCA_500_PPM       0 /*!< 251 ppm to 500 ppm */
#define MASTER_SCA_250_PPM       1 /*!< 151 ppm to 250 ppm */
#define MASTER_SCA_150_PPM       2 /*!< 101 ppm to 150 ppm */
#define MASTER_SCA_100_PPM       3 /*!< 76 ppm to 100 ppm */
#define MASTER_SCA_75_PPM        4 /*!< 51 ppm to 75 ppm */
#define MASTER_SCA_50_PPM        5 /*!< 31 ppm to 50 ppm */
#define MASTER_SCA_30_PPM        6 /*!< 21 ppm to 30 ppm */
#define MASTER_SCA_20_PPM        7 /*!< 0 ppm to 20 ppm */

/************************************************************/


/************** Definitions that can be changed. ************/

#define CONFIG_HW_HSE_TUNE      63

#define LS_SOURCE               CONFIG_HW_LS_RO
#define SMPS_INDUCTOR           CONFIG_HW_SMPS_10_UH

#define SLAVE_SCA_PPM           500     /* Max 500 */
#define HS_STARTUP_TIME_US      800
#define MAX_CONN_EVT_LEN        4000

#define DAY                     02
#define MONTH                   05
#define YEAR                    85
/************************************************************/

#ifndef CONFIG_HW_HSE_TUNE
#define CONFIG_HW_HSE_TUNE   63
#endif /* CONFIG_HW_HSE_TUNE */

#ifndef LS_SOURCE
#define LS_SOURCE       CONFIG_HW_LS_RO
#endif /* LS_SOURCE */

#ifndef SMPS_INDUCTOR
#define SMPS_INDUCTOR   CONFIG_HW_SMPS_10_UH
#endif /* SMPS_INDUCTOR */

#ifndef TEST_MODE
#define TEST_MODE       USER_MODE
#endif /* TEST_MODE */



const dev_config_t device_config =
{
  CONFIG_HW_HSE_TUNE,
  LS_SOURCE,
  SMPS_INDUCTOR,
  0xFF,
  HTOB(HS_STARTUP_TIME_US, 2),
  HTOB(SLAVE_SCA_PPM, 0),
  0xFF,
  HTOB(FROM_US_TO_SYS_TIME((MAX_CONN_EVT_LEN * 1000)), 4),
  TEST_MODE
};

